Tekla Open API Reference for Tekla Structures 2025
IGeometryNode.IsAutomatic Property
 Gets a value indicating whether this geometry node was automatically generated (i.e. false if it was originally a user-defined part)
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
bool IsAutomatic { get; }
ReadOnly Property IsAutomatic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IGeometryNode Interface
Tekla.Structures.Model Namespace